
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 5 to change, 6 to destroy.</code></pre>

* Update
  * azurerm_api_management_subscription.product[0]
  * module.apim_product[0].azurerm_api_management_product.product
  * module.application_insights_java.azurerm_monitor_activity_log_alert.main
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
* Replace
  * azurerm_storage_blob.b2c_policy_images[&#34;copyright.png&#34;]
  * azurerm_storage_blob.b2c_policy_images[&#34;copyright.svg&#34;]
  * azurerm_storage_blob.b2c_policy_images[&#34;favicon.ico&#34;]
  * azurerm_storage_blob.b2c_policy_images[&#34;govuk-crest-2x.png&#34;]
  * azurerm_storage_blob.b2c_policy_images[&#34;govuk-crest.png&#34;]
  * azurerm_storage_blob.b2c_policy_images[&#34;logo_gov.png&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.product[0] will be updated in-place
  ~ resource "azurerm_api_management_subscription" "product" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/d5a0ba59-f5ac-4e05-9650-2e5734c17e29"
        # (8 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_images["copyright.png"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_images" {
      ~ access_tier            = "Cool" -> (known after apply)
      + content_md5            = "ba68e29f2b8d6c98bbe820e2bf565ad2" # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/copyright.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "copyright.png"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/copyright.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_images["copyright.svg"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_images" {
      ~ access_tier            = "Cool" -> (known after apply)
      + content_md5            = "5fa12533de43c8a10381f171fd2c60c4" # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/copyright.svg" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "copyright.svg"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/copyright.svg" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_images["favicon.ico"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_images" {
      ~ access_tier            = "Cool" -> (known after apply)
      + content_md5            = "a90776c99cc9bf3d9dbe593284d6bbf6" # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/favicon.ico" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "favicon.ico"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/favicon.ico" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_images["govuk-crest-2x.png"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_images" {
      ~ access_tier            = "Cool" -> (known after apply)
      + content_md5            = "57a05afc1fc634420a02ff0151675de0" # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/govuk-crest-2x.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "govuk-crest-2x.png"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/govuk-crest-2x.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_images["govuk-crest.png"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_images" {
      ~ access_tier            = "Cool" -> (known after apply)
      + content_md5            = "bcd5768bd7721641ee71ba103bb38900" # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/govuk-crest.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "govuk-crest.png"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/govuk-crest.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_images["logo_gov.png"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_images" {
      ~ access_tier            = "Cool" -> (known after apply)
      + content_md5            = "d0302182b7348f7d23e7ceab1e5ab2ad" # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/logo_gov.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "logo_gov.png"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/logo_gov.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.apim_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pip-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.application_insights_java.azurerm_monitor_activity_log_alert.main will be updated in-place
  ~ resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached"
        name                = "Application Insights daily cap reached"
      ~ scopes              = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Insights/components/pip-ss-stg-nodejs-appinsights",
          + "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Insights/components/pip-ss-stg-java-appinsights",
        ]
        tags                = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (3 unchanged attributes hidden)

      ~ criteria {
          ~ resource_id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Insights/components/pip-ss-stg-nodejs-appinsights" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Insights/components/pip-ss-stg-java-appinsights"
            # (10 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule"
        name                    = "rotate-client-secrets-schedule"
      ~ start_time              = "2024-02-21T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects_trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects_trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule-single-trigger"
        name                    = "rotate-client-secrets-schedule-single-trigger"
      ~ start_time              = "2024-02-20T09:24:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 6 to add, 5 to change, 6 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":148,"Program":"tfcmt","SHA1":"","Vars":{}} -->